//Задача 1.Сделайте функцию, выводящую на экран сумму чисел от 1 до 100.
// function sum() {
//     let summ = 0;
//     for(let i=0; i<=100; i++){ 
//        summ = summ + i;
//     }
//     console.log(summ);
// }
// sum();

//PЗадачка 2.
//Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное.
// В первом случае пусть функция выводит на экран текст '+++', а во втором '---'.

// function x(numb) {
//    if(numb<0){
//        console.log("---");
//    } else{
//        console.log("+++");
//    }
// }
// x(-1);
// x(3);

//Задачка 3.
// function func(num1 = 0, num2 = 0) {
// 	console.log(num1 + num2);
// }

// func(2, 3); //5
// func(3); //3
// func() //0

//Задача 4
// Сделайте функцию, которая параметром принимает число, а возвращает квадратный корень из этого числа. 
// С помощью этой функции найдите корень числа 3, затем найдите корень числа 4.
//  Просуммируйте полученные результаты и выведите их на экран.

