// let arr = []; // вставить числа в массив через цикл
// for (let i = 0; i <= 4; i++) {
// 	arr[i] = i + 1;
// }
// console.log(arr); // будет [ 1, 2, 3, 4, 5 ]
 
//Задача 3
//С помощью цикла заполните массив числами от 1 до 100.
// let arr1 = []; 
// for (let i = 0; i <= 99; i++) {
// 	arr1[i] = i + 1;
// }
// console.log(arr1); 

//Задача 4
//С помощью цикла заполните массив c четными числами от 0 до 100
let arr1 = []; 
for (let i = 0, j = 2; i <= 100; i+=2, j++) {
	arr1[j] = i;
}
console.log(arr1); 

//Задача 4
// //С помощью цикла заполните массив нечетными числами в промежутке от 1 до 9.
let arr2 = []; 
for (let i = 1, j = 2; i <= 9; i+=2, j++) {
	arr2[j] = i;
}
console.log(arr2); 

//ИЛИ
